ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-21 Fri 00:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Specifications for microcontroller prototype</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Specifications for microcontroller prototype</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org187d7b7">1. Overview</a></li>
<li><a href="#orge63d5ed">2. Upstream sensor data</a>
<ul>
<li><a href="#orgbec35a3">2.1. Type</a></li>
<li><a href="#org0c94f67">2.2. Data specs</a></li>
<li><a href="#orgde71f37">2.3. Non-numeric codes</a>
<ul>
<li><a href="#orgb033dbf">2.3.1. Oxygen</a></li>
<li><a href="#org8ea25c7">2.3.2. Pressure</a></li>
</ul>
</li>
<li><a href="#orgd9ba2ee">2.4. Reference implementation</a></li>
</ul>
</li>
<li><a href="#orgfa7aba1">3. Downstream commnds</a>
<ul>
<li><a href="#orgc38b859">3.1. </a></li>
<li><a href="#org59275b1">3.2. O<sub>2</sub> sensor calibration</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org187d7b7" class="outline-2">
<h2 id="org187d7b7"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Documented here are the specifications for upstream data flow and downstream command flow from the microcontroller</li>
<li>Reference implementations of clients adhering to these specs are provided where possible</li>
<li>This document will change multiple times as prototype development progresses</li>
</ul>
</div>
</div>
<div id="outline-container-orge63d5ed" class="outline-2">
<h2 id="orge63d5ed"><span class="section-number-2">2</span> Upstream sensor data</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbec35a3" class="outline-3">
<h3 id="orgbec35a3"><span class="section-number-3">2.1</span> Type</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>The microcontroller outputs <b>serial</b> data at <b>9600 baud</b></li>
</ul>
</div>
</div>
<div id="outline-container-org0c94f67" class="outline-3">
<h3 id="org0c94f67"><span class="section-number-3">2.2</span> Data specs</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Data output from microcontroller is agnostic of the type of sensors connected to it</li>
<li><p>
If the microcontroller is configured to output <code>n</code> datapoints per cycle, the format for a single line of output will be
</p>

<p>
D<sub>1</sub> D<sub>2</sub> [&#x2026;] D<sub>n</sub> [EOL]
</p>

<p>
where each <i>D<sub>i</sub></i> is a datapoint and is seperated from other datapoints by a whitespace. The line will be terminated by a standard end-of-line terminator
</p></li>
<li>Each datapoint <i>D<sub>i</sub></i> is the datapoint corresponding to sensor <i>i</i> attached to the microcontroller</li>
<li>Each datapoint <i>D<sub>i</sub></i> is a utf-8 encoded 4-byte value</li>
<li><p>
In the event that a single microcontroller is configured to receive simultaneous input from different types of sensors, the data output format will be
</p>

<p>
S<sub>t</sub> D<sub>1</sub> D<sub>2</sub> [&#x2026;] D<sub>n</sub> [EOL]
</p>

<p>
Where <i>S<sub>t</sub></i> is a 1-bit value that indicates the type of sensors corresponding to the datapoints
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgde71f37" class="outline-3">
<h3 id="orgde71f37"><span class="section-number-3">2.3</span> Non-numeric codes</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Microcontroller outputs status and error messages particular to the different sensor types</li>
</ul>
</div>
<div id="outline-container-orgb033dbf" class="outline-4">
<h4 id="orgb033dbf"><span class="section-number-4">2.3.1</span> Oxygen</h4>
<div class="outline-text-4" id="text-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ERR1</td>
<td class="org-left">Invalid response slave ID exception</td>
</tr>

<tr>
<td class="org-left">ERR2</td>
<td class="org-left">Invalid response function exception</td>
</tr>

<tr>
<td class="org-left">ERR3</td>
<td class="org-left">Response timed out exception</td>
</tr>

<tr>
<td class="org-left">ERR4</td>
<td class="org-left">Invalid response CRC exception</td>
</tr>

<tr>
<td class="org-left">ERR5</td>
<td class="org-left">Modbus protocol illegal function exception</td>
</tr>

<tr>
<td class="org-left">ERR6</td>
<td class="org-left">Modbus protocol illegal data address exception</td>
</tr>

<tr>
<td class="org-left">ERR7</td>
<td class="org-left">Modbus protocol illegal data value exception</td>
</tr>

<tr>
<td class="org-left">ERR8</td>
<td class="org-left">Modbus protocol device failure</td>
</tr>

<tr>
<td class="org-left">STS0</td>
<td class="org-left">Sensor idle status</td>
</tr>

<tr>
<td class="org-left">STS1</td>
<td class="org-left">Sensor startup status</td>
</tr>

<tr>
<td class="org-left">STS2</td>
<td class="org-left">Sensor active status</td>
</tr>

<tr>
<td class="org-left">STS3</td>
<td class="org-left">Sensor shutdown status</td>
</tr>

<tr>
<td class="org-left">STS4</td>
<td class="org-left">Sensor standby status</td>
</tr>

<tr>
<td class="org-left">CAL0</td>
<td class="org-left">Calibration idle status</td>
</tr>

<tr>
<td class="org-left">CAL1</td>
<td class="org-left">Calibration in progress</td>
</tr>

<tr>
<td class="org-left">CAL2</td>
<td class="org-left">Calibration complete status</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8ea25c7" class="outline-4">
<h4 id="org8ea25c7"><span class="section-number-4">2.3.2</span> Pressure</h4>
<div class="outline-text-4" id="text-2-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ERR1</td>
<td class="org-left">Sensor in command mode error</td>
</tr>

<tr>
<td class="org-left">ERR2</td>
<td class="org-left">Stale data error</td>
</tr>

<tr>
<td class="org-left">ERR3</td>
<td class="org-left">Sensor diagnostic fault error</td>
</tr>

<tr>
<td class="org-left">ERR4</td>
<td class="org-left">Sensor missing error</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgd9ba2ee" class="outline-3">
<h3 id="orgd9ba2ee"><span class="section-number-3">2.4</span> Reference implementation</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>It is recommended that the data is timestamped on the data node responsible for receiving data from the microcontroller</li>
<li>Reference implementation of upstream communication client can be found in <a href="https://github.com/adkian/uctrl/blob/master/src/client/client.py">src/client/client.py</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfa7aba1" class="outline-2">
<h2 id="orgfa7aba1"><span class="section-number-2">3</span> Downstream commnds</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc38b859" class="outline-3">
<h3 id="orgc38b859"><span class="section-number-3">3.1</span> </h3>
</div>
<div id="outline-container-org59275b1" class="outline-3">
<h3 id="org59275b1"><span class="section-number-3">3.2</span> O<sub>2</sub> sensor calibration</h3>
</div>
</div>
</div>
</body>
</html>
